{
    "tarkov_bot": {
        "bot": {
            "__comment": [
                "In the bot category we store variables that affect the most basic bot functions.",
                "- bot_commands: [list (str)] All bot's commands. DO NOT CHANGE THE ORDER OF THE COMMANDS! A command names must NOT be the same as another name. A command names must NOT contain another name.",
                "- bot_token: [str] Token the bot runs on. CHANGE ONLY IF YOU KNOW WHAT IT IS!",
                "- bot_client: [str] Name and tag of the bot. EXAMPLE = example_name#0001"
            ],
            "bot_commands": [
                "$StartRaid",
                "$CloseRaid",
                "$Help",
                "$ForceCloseRaid",
                "$StartOnlyRaiders",
                "$ForceCloseOnlyRaiders",
                "$CloseOnlyRaiders"
            ],
            "bot_token": "NjQxMDY4OTg4OTY0NTM2MzYx.XctagA.Bda1rc1ArMb9Y4zYc8rMXecoPc8",
            "bot_client": "FaT Tarkov Bot#6869"
        },
        "general": {
            "__comment": [
                "In the general category we store variables that affect the message filtering of the bot.",
                "- allowed_channels: [list (str)] Channels in which the bot looks for commands. EXAMPLE = example-channel",
                "- allowed_role: [list (str)] List of roles which can use admin commands. EXAMPLE = Example Role",
                "- bot_activity: [str] Message to be displayed as the bot activity (Playing at ...). Set to null in case you don't want it (must not be in a str)."
            ],
            "allowed_channels": [
                "bot-command-line"
            ],
            "allowed_roles": [
                "GEN"
            ],
            "bot_activity": null
        },
        "role_assignment": {
            "__comment": [
                "In the role_assignment category we store variables that affect the role assignment message.",
                "- role_assignment_message_ids: [list (str)] IDs of the previous assignment messages. First str is for the raid message. Second str is for the raiders message.",
                "If there is not a previous assignment message or the bot runs into any deleting related errors change this value to null (must not be in a str).",
                "- role_assignment_channel_ids: [list (int)] IDs of the channels in which the roles get assigned. First id is for the raid role. Second id is for the raiders role.",
                "- role_assignment_emojis: [list (str)] Emoji (unicode) to be reacted to in order to receive the role. First str is for the raid emoji. Second str is for the raiders emoji.",
                "- role_assignment_roles: [list (str)] Role to be assigned when reacting to the message. First str is for the raid role. Second str is for the raiders role. EXAMPLE = Example Role"
            ],
            "role_assignment_message_ids": [
                "645608903593164830",
                "645608904121778187"
            ],
            "role_assignment_channel_ids": [
                636373893753470996,
                644195394997321773
            ],
            "role_assignment_emojis": [
                "✅",
                "✅"
            ],
            "role_assignment_roles": [
                "Raid",
                "Raiders"
            ]
        },
        "raid": {
            "__comment": [
                "In this category we store variables that affect the raid functions of the bot.",
                "- raid_role_id: [str] ID of the role to be mentioned when announcing a raid.",
                "- raid_emoji: [str] Emoji to be reacted to in order to join the raid.",
                "- raid_channel_id: [int] ID of the channel in which the raids get announced.",
                "- raid_allowed_channel: [str] Name of the channel in which the bot looks for raid commands."
            ],
            "raid_role_id": "642839885669072907",
            "raid_emoji": "✅",
            "raid_channel_id": 636374051169763357,
            "raid_allowed_channel": "bot-command-line"
        },
        "raiders": {
            "__comment": [
                "In this category we store variables that affect the raiders-only raid functions of the bot.",
                "- raiders_role: [str] ID of the role to be mentioned when announcing a raiders-only raid.",
                "- raiders_emoji: [str] Emoji to be reacted to in order to join the raiders-only raid.",
                "- raiders_channel_id: [int] ID of the channel in which the raiders-only raids get announced.",
                "- raiders_allowed_channel: [str] Name of the channel in which the bot looks for raiders-only raid commands.",
                "- allowed_raiders: [list (str)] Role which can use raiders commands. Write lowest tear first and the others in order of tear. EXAMPLE = Example Role"
            ],
            "raiders_role": "643984537629753365",
            "raiders_emoji": "✅",
            "raiders_channel_id": 636374051169763357,
            "raiders_allowed_channel": "bot-command-line",
            "allowed_raiders": [
                "EFT-RaiderMember",
                "EFT-RaiderVeteran",
                "EFT-LeadershipCommittee"
            ]
        }
    }
}